renesas/rx72n-envision-kit/demos/dev_mode_key_provisioning/src/aws_dev_mode_key_provisioning.c
        if( NULL != xProvisionedState.pcIdentifier )
        {
            configPRINTF( ( "Recommended certificate subject name: CN=%s\r\n", xProvisionedState.pcIdentifier ) );
        }

        prvWriteHexBytesToConsole( "Device public key",
                                   xProvisionedState.pucDerPublicKey,
                                   xProvisionedState.ulDerPublicKeyLength );

        /* Delay since the downstream demo code is likely to fail quickly if
         * provisioning isn't complete, and device certificate creation in the
         * lab may depend on the developer obtaining the public key. */
        /*vTaskDelay( pdMS_TO_TICKS( 100 ) ); */
    }

    /* Free memory. */
    if( NULL != xProvisionedState.pucDerPublicKey )
    {
        vPortFree( xProvisionedState.pucDerPublicKey );
    }

    if( NULL != xProvisionedState.pcIdentifier )
    {
        vPortFree( xProvisionedState.pcIdentifier );
    }

    return xResult;
}

/*-----------------------------------------------------------*/

/* Perform device provisioning using the specified TLS client credentials. */
CK_RV vAlternateKeyProvisioning( ProvisioningParams_t * xParams )
{
    CK_RV xResult = CKR_OK;
    CK_FUNCTION_LIST_PTR pxFunctionList = NULL;
    CK_SESSION_HANDLE xSession = 0;

    xResult = C_GetFunctionList( &pxFunctionList );

    /* Initialize the PKCS Module */
    if( xResult == CKR_OK )
    {
        xResult = xInitializePkcs11Token();
    }

    if( xResult == CKR_OK )
    {
        xResult = xInitializePkcs11Session( &xSession );
    }

    if( xResult == CKR_OK )
    {
        xResult = xProvisionDevice( xSession, xParams );

        pxFunctionList->C_CloseSession( xSession );
    }

    return xResult;
}

/*-----------------------------------------------------------*/

/* Perform device provisioning using the default TLS client credentials. */
CK_RV vDevModeKeyProvisioning( void )
{
    ProvisioningParams_t xParams;

    xParams.pucJITPCertificate = ( uint8_t * ) keyJITR_DEVICE_CERTIFICATE_AUTHORITY_PEM;
#if 0
    xParams.pucClientPrivateKey = ( uint8_t * ) keyCLIENT_PRIVATE_KEY_PEM;
    xParams.pucClientCertificate = ( uint8_t * ) keyCLIENT_CERTIFICATE_PEM;
#else
    static const char client_private_key_label[] = "client_private_key";
    static const char client_certificate_label[] = "client_certificate";
	static const char iot_thing_name_label[] = "iot_thing_name";
	static const char mqtt_broker_endpoint_label[] = "mqtt_broker_endpoint";
	static const char code_signer_certificate_label[] = "code_signer_certificate";
    uint8_t *client_private_key, *client_certificate;
    uint8_t *tmp;
    uint32_t data_length;

	xParams.pucClientPrivateKey = NULL;
	xParams.pucClientCertificate = NULL;

    R_SFD_Open();
    if(SFD_SUCCESS == R_SFD_GetObjectValue(
    		R_SFD_FindObject((uint8_t *)client_private_key_label, strlen(client_private_key_label)),
			&tmp,
			&data_length))
    {
        client_private_key = pvPortMalloc(data_length);
        memcpy(client_private_key, tmp, data_length);
        xParams.pucClientPrivateKey = ( uint8_t * ) client_private_key;
        if(SFD_SUCCESS == R_SFD_GetObjectValue(
        		R_SFD_FindObject((uint8_t *)client_certificate_label, strlen(client_certificate_label)),
    			&tmp,
    			&data_length))
        {
            client_certificate = pvPortMalloc(data_length);
            memcpy(client_certificate, tmp, data_length);
            xParams.pucClientCertificate = ( uint8_t * ) client_certificate;
        }
    }
    if(SFD_SUCCESS == R_SFD_GetObjectValue(
    		R_SFD_FindObject((uint8_t *)iot_thing_name_label, strlen(iot_thing_name_label)),
			&tmp,
			&data_length))
    {
    	clientcredentialIOT_THING_NAME = pvPortMalloc(data_length);
        memcpy(clientcredentialIOT_THING_NAME, tmp, data_length);
    }
    if(SFD_SUCCESS == R_SFD_GetObjectValue(
    		R_SFD_FindObject((uint8_t *)mqtt_broker_endpoint_label, strlen(mqtt_broker_endpoint_label)),
			&tmp,
			&data_length))
    {
    	clientcredentialMQTT_BROKER_ENDPOINT = pvPortMalloc(data_length);
        memcpy(clientcredentialMQTT_BROKER_ENDPOINT, tmp, data_length);
    }
    if(SFD_SUCCESS == R_SFD_GetObjectValue(
    		R_SFD_FindObject((uint8_t *)code_signer_certificate_label, strlen(code_signer_certificate_label)),
			&tmp,
			&data_length))
    {
    	signingcredentialSIGNING_CERTIFICATE_PEM = pvPortMalloc(data_length);
        memcpy(signingcredentialSIGNING_CERTIFICATE_PEM, tmp, data_length);
    }

#endif
    /* If using a JITR flow, a JITR certificate must be supplied. If using credentials generated by
     * AWS, this certificate is not needed. */
    if( ( NULL != xParams.pucJITPCertificate ) &&
        ( 0 != strcmp( "", ( const char * ) xParams.pucJITPCertificate ) ) )
    {
        /* We want the NULL terminator to be written to storage, so include it
         * in the length calculation. */
        xParams.ulJITPCertificateLength = sizeof( char ) + strlen( ( const char * ) xParams.pucJITPCertificate );
    }
    else
    {
        xParams.pucJITPCertificate = NULL;
    }

    /* The hard-coded client certificate and private key can be useful for
     * first-time lab testing. They are optional after the first run, though, and
     * not recommended at all for going into production. */
    if( ( NULL != xParams.pucClientPrivateKey ) &&
        ( 0 != strcmp( "", ( const char * ) xParams.pucClientPrivateKey ) ) )
    {
        /* We want the NULL terminator to be written to storage, so include it
         * in the length calculation. */
        xParams.ulClientPrivateKeyLength = sizeof( char ) + strlen( ( const char * ) xParams.pucClientPrivateKey );
    }
    else
    {
        xParams.pucClientPrivateKey = NULL;
    }

    if( ( NULL != xParams.pucClientCertificate ) &&
        ( 0 != strcmp( "", ( const char * ) xParams.pucClientCertificate ) ) )
    {
        /* We want the NULL terminator to be written to storage, so include it
         * in the length calculation. */
        xParams.ulClientCertificateLength = sizeof( char ) + strlen( ( const char * ) xParams.pucClientCertificate );
    }
    else
    {
        xParams.pucClientCertificate = NULL;
    }

    return vAlternateKeyProvisioning( &xParams );
}

/*-----------------------------------------------------------*/
